codeigniter4(respaldo)/app/Models/CasillerosModel.php

SELECT `casilleros`.*, `libros`.`lib_nombre`
FROM `casilleros`
LEFT JOIN `libros` ON `libros`.`lib_id` = `casilleros`.`libro_id`
WHERE `casilleros`.`ocupado` IS NULL
AND `casilleros`.`ocupado` IS NULL
ORDER BY `casilleros`.`casillero_id` ASC
---
    public function getCasillerosWithLibro()
    {
        // Realizamos un JOIN con la tabla 'libros' para obtener el 'lib_nombre'
        // Usamos un 'left' join porque un casillero puede no tener un libro asignado (libro_id es NULL)
        return $this->select('casilleros.*, libros.lib_nombre')
                    ->join('libros', 'libros.lib_id = casilleros.libro_id', 'left')
                    ->where('casilleros.ocupado', NULL) // Mantenemos la condición de no "ocupado" (soft-deleted)
                    ->orderBy('casilleros.casillero_id', 'ASC')
                    ->findAll();