codeigniter4(respaldo)/app/Controllers/Casilleros.php

INSERT INTO `casilleros` (`cedula`, `nombre`, `libro_id`, `created_at`, `updated_at`) VALUES ('30666972', 'yeliant', '33', '2025-06-22 13:50:14', '2025-06-22 13:50:14')
---

        $datos = array_map('trim', $datos);

        $this->CasillerosModel->insert($datos);

SELECT *
FROM `libros`
ORDER BY `lib_nombre` ASC
---
    public function editar($id = null)
    {
        $datos['casillero'] = $this->CasillerosModel->find($id);
        $datos['libros'] = $this->LibrosModel->orderBy('lib_nombre', 'ASC')->findAll();

UPDATE `casilleros` SET `cedula` = '31944662', `nombre` = 'otro', `libro_id` = '35', `updated_at` = '2025-06-22 13:49:55'
WHERE `casilleros`.`casillero_id` IN ('4')
---

        $datos = array_map('trim', $datos);

        $this->CasillerosModel->update($id, $datos);