codeigniter4(respaldo)/app/Controllers/Eventos.php

SELECT *
FROM `eventos`
WHERE `estado` IS NULL
---
    public function agenda(){

        $eventos = $this->EventosModel->where(['estado' => null])->findAll();