codeigniter4/app/Controllers/Users.php

SELECT *
FROM `users`
WHERE `user_email` = 'antahony@gmail.com'
AND `user_active` = 1
AND `deleted_at` IS NULL
AND `users`.`deleted_at` IS NULL
 LIMIT 1
SELECT *
FROM `users`
WHERE `user_active` = 1
AND `deleted_at` IS NULL
AND `users`.`deleted_at` IS NULL
 LIMIT 1
UPDATE `users` SET `user_reset_token` = '370bdb27c0ed98529e51d7095c63a2d44c8f5ed7', `user_reset_expires_at` = '2025-03-15 15:04:51', `updated_at` = '2025-03-15 14:04:51'
WHERE `users`.`user_id` IN ('36')
---
    public function sendResetLinkEmail(){

        $rules = [
            'email' => 'required|max_length[80]|valid_email'
        ];

        if(!$this->validate($rules)){
            return redirect()->back()->withInput()->with('errors', $this->validator->listErrors());
        }

        $userModel = new UsersModel();
        $post = $this->request->getPost(['email']);
        $user = $userModel->where(['user_email'=> $post['email'], 'user_active' => 1, 'deleted_at' => null])->first();
        $user1 = $userModel->where(['user_active' => 1, 'deleted_at' => null])->first();

        if(!$user1){

            $title = 'Usuario Inactivo o Bloqueado';
            $message = 'En caso estar inactivo, revise su correo de validación si no lo ha hecho.';

            return $this->showMessage($title, $message);

            }

        if($user){
            $token = bin2hex(random_bytes(20));

            $expiresAt = new \Datetime();
            $expiresAt->modify('+1 hour');

            $userModel->update($user['user_id'],[
                'user_reset_token' => $token,
                'user_reset_expires_at' => $expiresAt->format('Y-m-d H:i:s')
            ]);